Tekla Open API Reference for Tekla Structures 2025
Rotation3D.Equals Method
Compares with another rotation.
 Namespace: Tekla.Structures.Model.Geometry
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Equals(
	Rotation3D other,
	double tolerance
)
Public Function Equals (
	other As Rotation3D,
	tolerance As Double
) As Boolean
Parameters
other
Type: Tekla.Structures.Model.Geometry.Rotation3D
The other rotation.
tolerance
Type: System.Double
Comparison tolerance.
Return Value
Type: Boolean
True if found equal, false otherwise.
See Also
Reference
Rotation3D Class
Tekla.Structures.Model.Geometry Namespace